{
  "forenames": "Cara",
  "surname": "Gifford-Pitcher",
  "profession": "Quality Assurance Engineer for Software Development",
  "dob": "30th November 1983",
  "gender": "Female",
  "location": "Southend, Essex",
  "citizenship": "British",
  "telephone": "07595429738",
  "email": "caragp@gmail.com",
  "cvUrl": "https://caragp.github.io/cv",
  "social": [
    {
      "label": "LinkedIn",
      "url": "https://www.linkedin.com/in/cara-gifford-pitcher-02577a22/",
      "text": "linkedin.com/in/cara-gifford-pitcher-02577a22"
    }
  ],
  "introductions": [
    "Over 13 years experience in the field of Quality Assurance. High level of attention to detail, adaptable, and with experience in Manual and Automation test approaches. Experienced with both Scrum and Agile methodologies and processes across multiple software development areas, including Mobile, Connected devices and Gaming Applications."
  ],
  "skills": [
    "Behaviour-driven development (BDD) in the form of early Gherkin scenario writing/refining",
    "Test-driven development (TDD)",
    "Visual Studio Code",
    "Cypress",
    "Basics of JavaScript test definitions",
    "GitHub",
    "Graylog",
    "Storybook",
    "Postman",
    "TestRail",
    "Jira"
  ],
  "complimentarySkills": [
    "Advocate for Lean Kanban approaches.",
    "Advocate and strong supporter of Agile processes and mentality.",
    "Drives for technical excellence & quality-first focus.",
    "Advisor and guide for better Gherkin scenario writing and BDD implementation.",
    "Advocate for team transparency.",
    "Bridges the natural language gap between business and engineer.",
    "Drives for constantly improving processes.",
    "Efficient learning ability for new feature, tools, processes and frameworks.",
    "Ability to manipulate data, investigating errors via logging tools for a wider range of understanding.",
    "Not just testing something works, but striving to understand why it doesn't and could it do it better?"
  ],
  "me": [
    "I drive for Quality over Quantity, and aim to change the way teams think about general quality and testing approaches.",
    "Interested in joining a improvement-driven cross-functional team, where I can extend my knowledge and hands on experience."
  ],
  "meReadMore": [
    "I consider it one of my professional mandates to mentor and coach members of my team, and the wider engineering team, that quality is everyone's responsibility.",
    "Able to work on my own, but I prefer working directly with developers, product, design, and all other elements in a cross-functional team.",
    "I am approachable and easy to get on with; providing both a friendly ear and a rubber duck alternative for ideas and problem solving. My communication skills are of a high standard; willing and able to converse with all levels and experiences.",
    "I see myself as artistic and creative. Hobbies include art and crafts, and computer games."
  ],
  "experience": [
    {
      "jobTitle": "Senior QA Engineer",
      "companyName": "InfoSum",
      "companyLogo": "infosum.svg",
      "startDate": "Sept 2021",
      "about": [
        "Part of a small engineering team working on a SAAS Platform in the Marketing, Data Cleanroom space. Storing and providing a service to allow for data querying to help with Marketing specific user groups and general campaigns."
      ],
      "aboutReadMore": [
        "Fully manual role, conducting testing during the development lifecycle of many various features and updates to a singular software platform across multiple environments and setups. Scenario writing, being an active member of planning and discovery phases, as well as continuous advocation of continued evolution of our development approach."
      ],
      "additionalSkillList": {
        "title": "Responsibilities included:",
        "skills": [
          "Investigating and presenting quality management and tracking tools to improve our testing approach.",
          "Advising and reviewing the creation of various DOR/DOD documentation (Definition of Ready/Definition of Done).",
          "Mentor and guide on matters of general testing best practices, and troubleshooting for fellow QA Engineers and Developers.",
          "Presenting BDD Good Practices to improve our approach with Acceptance Criteria and Scenario writing for a more uniformed language approach between Product and Engineering.",
          "Tracking and Reporting on Deployment and Automated Test Failure Frequency and it's impact on delivery."
        ]
      }
    },
    {
      "jobTitle": "QA Engineer",
      "companyName": "Discovery Inc.",
      "companyLogo": "discovery.png",
      "startDate": "Oct 2020",
      "endDate": "Sept 2021",
      "about": [
        "Part of a team responsible for creating and maintaining Discovery's Connected/Smart TV devices software application, which allows users to watch various Discovery Channel content."
      ],
      "aboutReadMore": [
        "Heavily manual role, conducting end-to-end testing a software application platform across multiple pieces of hardware."
      ],
      "additionalSkillList": {
        "title": "Responsibilities included:",
        "skills": [
          "Implementation and maintenance of various test-plans to cover the end-to-end testing of the various hardware platforms we supported.",
          "Creating DOR/DOD documentation (Definition of Ready/Definition of Done).",
          "Mentor and guide on matters of general testing best practices, and troubleshooting for fellow QA Engineers."
        ]
      }
    },
    {
      "jobTitle": "Senior Test Engineer",
      "companyName": "Kobalt Music",
      "companyLogo": "kobalt.svg",
      "startDate": "Feb 2018",
      "endDate": "March 2020",
      "about": [
        "Part of various teams responsible for creating and maintaining some of the front-end, data-driven pages. Displaying useful streaming and media consumption statistics, as well as monetary earnings and expenditure values."
      ],
      "aboutReadMore": [
        "Sole tester for cross-functional teams, covering and implementing evolving test processes; driving quality-first approaches.",
        "Advisor for fellow QA Engineers, coaching and improving the more junior members confidence with BDD and quality driven development in their own respective teams."
      ],
      "additionalSkillList": {
        "title": "Responsibilities included:",
        "skills": [
          "Implementation and maintenance of Acceptance/Functional automation test suites, covering both Frontend and Backend functionality, in Javascript and PHP.",
          "Mentor junior members of the team in good automation practice such as BDD and quality-first focus.",
          "Implementing new testing tools to aid with quality monitoring, such as a Mutation Testing tool.",
          "Creating and updating DOR/DOD documentation (Definition of Ready/Definition of Done).",
          "One of the leading spokespeople for implementing a QA Engineer earlier in the development process.",
          "One of the leading coordinators for evolving Jira, Development & Delivery processes.",
          "Mentor and guide on matters of general testing best practices, and troubleshooting for fellow QA Engineers.",
          "Presented and helped organise presentations and documentation on the following topics:",
          [
            "BDD best practices.",
            "Double Diamond development process.",
            "Mutation testing.",
            "Testing best practices.",
            "How to test Automation Scenarios and both Frontend and Backend functionality."
          ]
        ]
      }
    },
    {
      "jobTitle": "QA Analyst",
      "companyName": "Stadion",
      "companyLogo": "stadion.svg",
      "startDate": "Sept 2017",
      "endDate": "Dec 2017",
      "about": [
        "Solo quality representative for a small startup company, which hosted various football websites."
      ],
      "aboutReadMore": [
        "The company's first QA member. Hired to help mentor and guide the close-knit team approach to more quality driven development, and improve their test coverage."
      ],
      "additionalSkillList": {
        "title": "Responsibilities included:",
        "skills": [
          "Created documentation and provided guidance on Jira tickets creation.",
          "Mentored the team on BDD best practices.",
          "Learned how to use Ghost Inspector to create Automated Regression suites for purely Frontend testing.",
          "Investigated running Ghost Inspector test suites on deployment using Octopus Deploy build service.",
          "Some experience with connecting Runscope API testing tool to a Ghost Inspector test suite.",
          "Some experience using Sitecore and Umbraco content management systems."
        ]
      }
    },
    {
      "jobTitle": "QA Lead",
      "companyName": "Brighttalk",
      "companyLogo": "brighttalk.svg",
      "startDate": "Sept 2014",
      "endDate": "Sept 2017",
      "about": [
        "Lead a small cross-region Testing Team (US, UK, Lithuania), covering testing for a Webinar service website."
      ],
      "aboutReadMore": [
        "Looking after the QA team, organising, monitoring and providing end-to-end, regression testing and driving the implementation of automation testing."
      ],
      "additionalSkillList": {
        "title": "Responsibilities included:",
        "skills": [
          "Wrote test documentation and test plans.",
          "Some experience with using SoapUI API tool to create and run tests for microservices.",
          "Some experience writing automated test cases in Java using Selenium Webdriver and IntelliJ.",
          "Cross browser and Mobile testing.",
          "Experienced with Agile, Kanban and Waterfall project cycles.",
          "Worked directly with Developers and Product Managers.",
          "Experienced with QTest test management tool.",
          "Mentoring fellow QA.",
          "Able to monitor Network and Console Logs."
        ]
      }
    },
    {
      "jobTitle": "QA Lead",
      "otherTitles": ["QA"],
      "companyName": "Monitise Create",
      "formerCompanyName": "Grapple",
      "companyLogo": "Monitise_logo.svg",
      "startDate": "Dec 2011",
      "endDate": "Aug 2014",
      "about": [
        "Part of a versatile testing unit for a Mobile Application Agency, covering a range of different mobile platforms and application modals."
      ],
      "aboutReadMore": [
        "Senior tester, responsible for leading test efforts and representative for outsourced projects. Helped drive change and testing culture within the business."
      ],
      "additionalSkillList": {
        "title": "Responsibilities included:",
        "skills": [
          "Wrote and improved test documentation and test plans.",
          "Experienced with the use of Charles Proxy to monitor and manipulate API calls between the app and server.",
          "Experienced with the use of XCode and ADT Eclipse to obtain crash logs for both Android and iPhone devices.",
          "Experienced with Window 8 devices and applications.",
          "Experienced with Agile, Scrum and Waterfall project cycles.",
          "Worked directly with Developers and Designers through project cycles.",
          "Work on various Financial Services, in-built software, Shopping, and Sports applications.",
          "Experienced with Jira and TestRail test management tool.",
          "Mentoring other members of QA and the Development Team in the use of the various tools required for projects.",
          "Some experience with Automation Testing using EggPlant and Selenium IDE frameworks."
        ]
      }
    },
    {
      "jobTitle": "Junior Mastering Technician",
      "otherTitles": ["Acting Project Manager, Senior QA, QA"],
      "companyName": "SEGA Europe",
      "companyLogo": "sega.png",
      "startDate": "Apr 2007",
      "endDate": "Dec 2011",
      "about": [
        "Covered various roles within the testing/quality department for a well-established and long-running games company."
      ],
      "aboutReadMore": [
        "Evolved from simply testing games to organising testing responsibilities and daily coverage. Also monitoring and organising test management data between shifts and different business units. Then moved into hardware and software management, being involved with the software submissions and submission monitoring."
      ],
      "additionalSkillList": {
        "title": "Responsibilities included:",
        "skills": [
          "Created test documentation.",
          "Experienced with Planning and Project Scheduling.",
          "Keeping a constant line of communication open with Leads and Line Managers.",
          "Lead a small team working on Flash and Emulated titles on Sega’s online gaming website.",
          "Learned API error debugging.",
          "Tested a variety of games on the various different platforms around and popular at the time.",
          "Sending and receiving code from Producers.",
          "Created image files from raw product code.",
          "Responsible for submitting Game Code to distributors for final evaluation and manufacturing approval.",
          "Experienced with the maintenance of various consoles and their respective virtual console suites."
        ]
      }
    }
  ]
}
